provider/ws-payment-all-security/src/main/webapp/WEB-INF/config/request_messge/Subjectkey_Identifier.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:oss="http://payment.javatech.com/ws/schema/oss" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<ds:Signature Id="Signature-30" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="#id-24">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>ojjvRnsGjipRj2IXQhpb+MuF5fQ=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>
					Et8S+3rCUNF9Ynn6JfpLiwhd+qqjPQ831wurGYnKzfiudXEf3zIIv0QpUaFKS2/yltdKRMTc0jlF
					44b+5swi/kAAb2l1q+PM6kc9Zx5T3Ow+hyFHP2CJH1alfdpJ4ptALKiBLOOribNGGW0y+T+tx9WY
					HzalpgNkDoLSaOYqwBg3QopyCL2v0hlPar1Ewj2f06EkJS9P95Qw/EmscFXNYJjjbnPvg9RpvMsZ
					GEVYefZN2vOXZnBhvBXxotLKKC4Ywp0Q2E0l3qDNc+Z32baQX6t0Be10X1/4y+9HrOixEIeSsmMP
					X5NOYI8SqvOxPe4CUmFaDAp5fIn5/z++Ib0XtQ==
				</ds:SignatureValue>
				<ds:KeyInfo Id="KeyId-BDB40A9554F194E975132440020245156">
					<wsse:SecurityTokenReference wsu:Id="STRId-BDB40A9554F194E975132440020245157" 
						xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
						<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" 
							ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">
							a34hxvIVgToU2wxpu/OlRW+soi0=
							</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</soapenv:Header>

	<soapenv:Body wsu:Id="id-24" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
		<oss:paymentRequest>
			<oss:amount>245</oss:amount>
			<oss:cardNumber>2222222222328</oss:cardNumber>
			<oss:expirationDate>12/12</oss:expirationDate>
			<oss:securityCode>123</oss:securityCode>
			<oss:nameOnCard>per auras</oss:nameOnCard>
		</oss:paymentRequest>
	</soapenv:Body>
</soapenv:Envelope>
